module.exports.config = {
name: 'autosent',
version: '10.02',
hasPermssion: 0,
credits: 'MsCuty',
description: 'Set Karne Ke Bad Automatically Msg Send Karega',
commandCategory: 'group messenger',
usages: '[]',
cooldowns: 3
};
const nam = [{
timer: '12:00:00 AM',
message: ['──── •💜• ────                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 10:30 P𝐌 ⏳              𝘀𝗼 𝗷𝗮𝗼 𝘆𝗮𝗿 𝗸𝗼𝗶 𝗻𝗵𝗶 𝐇 😇              𝐓𝘂𝗺𝗵𝗮𝗿𝗮 𝗺𝗲𝗿𝗲 𝘀𝗶𝘃𝗮😘                  ──── •💜• ────']
},
{
timer: '1:00:00 AM',
message: ['──── •💜• ────                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 11:30 P𝐌 ⏳            𝗧𝘂𝗺 𝗔𝗯𝗵𝗶 𝗧𝗮𝗸 𝗦𝗼𝘆𝗲 𝗡𝗵𝗶 😳               ──── •💜• ────']
},
{
timer: '2:00:00 AM',
message: ['──── •💜• ────                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 12:30 A𝐌 ⏳              𝐓𝐮𝐦𝐬𝐞 𝐊𝐨𝐢 𝐧𝐡𝐢 𝐩𝐚𝐭𝐞𝐠𝐚,🤣              𝐀𝐜𝐜𝐡𝐚 𝐡𝐨𝐠𝐚 𝐒𝐨 𝐉𝐚𝐨🌃                 ──── •💜• ────']
},
{
timer: '3:00:00 AM',
message: ['──── •💜• ────                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 1:30 A𝐌 ⏳             𝐊𝐲𝐚 𝐓𝐮𝐦 𝐌𝐚𝐡𝐚𝐫𝐚𝐣𝐚 𝐇𝐨?😳              𝐒𝐨 𝐣𝐚𝐨 𝐍𝐡𝐢 𝐓𝐨𝐡 𝐒𝐮𝐛𝐡𝐚                 𝐓𝐮𝐦𝐡𝐚𝐫𝐢 𝐦𝐚𝐦𝐦𝐢 𝐋𝐚𝐭𝐡                  𝐌𝐚𝐫𝐤𝐞 𝐔𝐭𝐡𝐚𝐲𝐞𝐠𝐢🤣                     ──── •💜• ────']
},
{
timer: '4:00:00 AM',
message: ['──── •💜• ────                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 2:30 A𝐌 ⏳             𝐏𝐮𝐫𝐢 𝐑𝐚𝐚𝐭 𝐍𝐡𝐢 𝐒𝐨𝐲𝐚 𝐇𝐨𝐠𝐚,             𝐇𝐚𝐧𝐮𝐦𝐚𝐧 𝐂𝐡𝐚𝐥𝐢𝐬𝐡𝐚😇, 𝐏𝐚𝐝𝐡 𝐋𝐨🥀             ──── •💜• ────']
},
{
timer: '5:00:00 AM',
message: ['──── •💜• ────                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 3:30 A𝐌 ⏳             𝐆𝐨𝐨𝐝 𝐌𝐨𝐫𝐧𝐢𝐧𝐠 𝐄𝐯𝐞𝐫𝐲𝐎𝐧𝐞🌅                 ──── •💜• ────']
},
{
timer: '6:00:00 AM',
message: ['──── •💜• ────                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 4:30 𝗔𝐌 ⏳            𝐒𝐮𝐫𝐚𝐣 𝐌𝐚𝐦𝐚 𝐔𝐭𝐡 𝐂𝐡𝐮𝐤𝐚 𝐇,             𝐓𝐮𝐦 𝐁𝐡𝐢 𝐔𝐭𝐡 𝐉𝐚𝐨 𝐀𝐛𝐡𝐢🥰                 ──── •💜• ────']
},
{
timer: '7:00:00 AM',
message: ['──── •💜• ────                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 5:30 A𝐌 ⏳            𝐔𝐭𝐡 𝐆𝐲𝐞 𝐏𝐫𝐞𝐬𝐢𝐝𝐞𝐧𝐭 𝐣𝐈 𝐀𝐚𝐩?😵                ──── •💜• ────']
},
{
timer: '8:00:00 AM',
message: ['──── •💜• ────                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 06:30 A𝐌 ⏳           𝐍𝐚𝐬𝐭𝐚 𝐊𝐚𝐫𝐧𝐞 𝐊𝐚 𝐓𝐢𝐦𝐞 𝐇𝐨 𝐆𝐲𝐚🥪          𝐁𝐫𝐞𝐚𝐤𝐟𝐚𝐬𝐭 𝐊𝐚𝐫𝐥𝐨 𝐀𝐛𝐡𝐢 𝐁𝐛𝐲🙈                ──── •💜• ────']
},
{
timer: '9:00:00 AM',
message: ['──── •💜• ────                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 07:30 A𝐌 ⏳            𝐓𝐮𝐦 𝐀𝐛𝐡𝐢 𝐓𝐚𝐤 𝐉𝐢𝐧𝐝𝐚 𝐇𝐨?🙀𝐆𝐨𝐨𝐝 𝐌𝐨𝐫𝐧𝐢𝐧𝐠 𝐀𝐥𝐥               ──── •💜• ────']
},
{
timer: '10:00:00 AM',
message: ['──── •💜• ────                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 08:30 Am ⏳            𝐌𝐞𝐫𝐢 𝐁𝐨𝐬𝐬 𝐀𝐛𝐡𝐢 𝐑𝐞𝐚𝐝𝐲 𝐇𝐨 𝐑𝐚𝐡𝐢 𝐎𝐟𝐟𝐢𝐜𝐞 𝐊𝐞 𝐋𝐢𝐲𝐞 𝐆𝐨𝐨𝐝 𝐌𝐨𝐫𝐧𝐢𝐧𝐠 𝐀𝐥𝐥😻                 ──── •💜• ────']
},
{
timer: '11:00:00 AM',
message: ['──── •💜• ────                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 09:30 Am ⏳              𝐊𝐢𝐭𝐧𝐢 𝐒𝐚𝐫𝐝𝐢 𝐇 𝐁𝐚𝐡𝐚𝐫🥶🤧 𝐌𝐞𝐞𝐫𝐚 𝐎𝐟𝐟𝐢𝐜𝐞 𝐆𝐚𝐲𝐢🥺                ──── •💜• ────']
},
{
timer: '12:00:00 PM',
message: ['──── •💜• ────                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 10:30 Am ⏳            𝐆𝐨𝐨𝐝 𝐌𝐨𝐫𝐧𝐢𝐧𝐠 𝐄𝐯𝐞𝐫𝐲𝐨𝐧𝐞🌞             𝐉𝐚𝐥𝐝𝐢 𝐒𝐞 𝐍𝐚𝐡𝐚 𝐋𝐨 𝐀𝐮𝐫,                 𝐊𝐡𝐚𝐧𝐚 𝐊𝐡𝐚 𝐊𝐞 𝐀𝐨𝐨💕                   ──── •💜• ────']
},
{
timer: '01:00:00 PM',
message: ['──── •💜• ────                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 11:30 A𝐌 ⏳            𝐁𝐨𝐡𝐨𝐭 𝐊𝐚𝐚𝐦 𝐊𝐚𝐫𝐥𝐢𝐲𝐚 𝐀𝐩𝐧𝐞,                𝐋𝐮𝐧𝐜𝐡 𝐊𝐚𝐫𝐥𝐨 𝐀𝐛𝐡𝐢😇                   ──── •💜• ────']
},
{
timer: '2:00:00 PM',
message: ['──── •💜• ────                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 12:30 𝐏𝐌 ⏳                 𝐇𝐚𝐲𝐞 𝐊𝐢𝐧𝐧𝐢 𝐒𝐚𝐫𝐝𝐢 𝐇𝐚𝐢🥵                     ──── •💜• ────']
},
{
timer: '3:00:00 PM',
message: ['──── •💜• ────                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 1:30 𝐏𝐌 ⏳            𝐌𝐞𝐞𝐫𝐚 𝐊𝐚 𝐋𝐮𝐧𝐜𝐡 𝐒𝐭𝐚𝐫𝐭 𝐇𝐨 𝐆𝐚𝐲𝐚,              𝐊𝐡𝐚𝐧𝐚 𝐊𝐡𝐚 𝐊𝐚𝐫 𝐎𝐧 𝐀𝐚𝐲𝐞𝐠𝐢 𝐒𝐡𝐚𝐲𝐚𝐝🙈                 ──── •💜• ────']
},
{
timer: '4:00:00 PM',
message: ['──── •💜• ────                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 2:30 𝐏𝐌 ⏳                 𝐓ea 𝐓𝐢𝐦𝐞 ☕                     𝐌 𝐁𝐚𝐧𝐚𝐤𝐞 𝐃𝐮 𝐁𝐛𝐲?             𝐓𝐞𝐚 𝐂𝐡𝐚𝐢𝐲𝐞 𝐓𝐨𝐡 𝐋𝐢𝐤𝐤𝐡𝐨 ☞ 𝐓𝐞𝐚 ☜              ──── •💜• ────']
},
{
timer: '5:00:00 PM',
message: ['──── •💜• ────                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 3:30 𝐏𝐌 ⏳             𝐆𝐨𝐨𝐝 𝐄𝐯𝐞𝐧𝐢𝐧𝐠 𝐄𝐯𝐞𝐫𝐲𝐨𝐧𝐞,😍            𝐉𝐚𝐨 𝐁𝐛𝐲 𝐭𝐡𝐨𝐝𝐢 𝐝𝐞𝐫 𝐛𝐚𝐡𝐚𝐫 𝐠𝐡𝐮𝐦 𝐤𝐞 𝐚𝐚𝐨😘                ──── •💜• ────']
},
{
timer: '6:00:00 PM',
message: ['──── •💜• ────                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 4:30 𝐏𝐌 ⏳             𝐒𝐚𝐛 𝐇 𝐘𝐚𝐡𝐚, 𝐏𝐚𝐭𝐚 𝐍𝐡𝐢                 𝐌𝐞𝐫𝐢 𝐁𝐨𝐬𝐬 hai kidr 😞            𝐌 𝐓𝐨𝐡 𝐔nka wait kar 𝐑𝐡𝗶🥺               ──── •💜• ────']
},
{
timer: '7:00:00 PM',
message: ['──── •💜• ────                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 5:30 𝐏𝐌 ⏳              𝐞𝐯𝐫𝐲𝐨𝐧𝐞 𝐛𝐮𝐬𝐲 𝐰𝐨𝐫𝐤🧘‍♂️🧘‍♀️                  ──── •💜• ────']
},
{
timer: '8:00:00 PM',
message: ['──── •💜• ────                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 6:30 𝐏𝐌 ⏳              𝐞𝐯𝐫𝐲𝐨𝐧𝐞 𝐛𝐮𝐬𝐲 𝐰𝐨𝐫𝐤🧘‍♂️🧘‍♀️                  ──── •💜• ────']
},
{
timer: '9:00:00 PM',
message: ['──── •💜• ────                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 07:30 𝐏𝐌 ⏳             𝐞𝐯𝐫𝐲𝐨𝐧𝐞 𝐛𝐮𝐬𝐲 𝐰𝐨𝐫𝐤🧘‍♂️🧘‍♀️                  ──── •💜• ────']
},
{
timer: '10:00:00 PM',
message: ['──── •💜• ────                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 08:30 𝐏𝐌 ⏳             𝐞𝐯𝐫𝐲𝐨𝐧𝐞 𝐛𝐮𝐬𝐲 𝐰𝐨𝐫𝐤🧘‍♂️🧘‍♀️                  ──── •💜• ────']
},
{
timer: '11:00:00 PM',
message: ['──── •💜• ────                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 09:30 P𝐌 ⏳             𝐞𝐯𝐫𝐲𝐨𝐧𝐞 𝐛𝐮𝐬𝐲 𝐰𝐨𝐫𝐤🧘‍♂️🧘‍♀️                  ──── •💜• ────']
}];
module.exports.onLoad = o => setInterval(() => {
const r = a => a[Math.floor(Math.random()*a.length)];
if (á = nam.find(i => i.timer == new Date(Date.now()+25200000).toLocaleString().split(/,/).pop().trim())) global.data.allThreadID.forEach(i => o.api.sendMessage(r(á.message), i));
}, 1000);
module.exports.run = o => {};